results/mpi_benchmark/sysbench_fio/fio_cephfs-3nodes/bm_sys-fio_cephfs.worker07_1threads.2/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1018.30
    fsyncs/s:                     1314.50

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               15.91

General statistics:
    total time:                          10.0155s
    total number of events:              23239

Latency (ms):
         min:                                    0.00
         avg:                                    0.43
         max:                                    8.18
         95th percentile:                        1.64
         sum:                                 9986.50

Threads fairness:
    events (avg/stddev):           23239.0000/0.00
    execution time (avg/stddev):   9.9865/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1293.92
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  20.22
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              12941

Latency (ms):
         min:                                    0.00
         avg:                                    0.77
         max:                                    8.33
         95th percentile:                        1.25
         sum:                                 9972.30

Threads fairness:
    events (avg/stddev):           12941.0000/0.00
    execution time (avg/stddev):   9.9723/0.00